class Ant:
    """
    Класс Ant представляет муравья для алгоритма ACO.

    Атрибуты:
        A (int): Коэффициент влияния феромона.
        B (int): Коэффициент влияния расстояния (привлекательности).
    """

    def __init__(self, A: int = 1, B: int = 1) -> None:
        """
        Инициализирует объект Ant с заданными коэффициентами влияния феромона и расстояния.

        :param A: Коэффициент влияния феромона (по умолчанию 1).
        :param B: Коэффициент влияния расстояния (по умолчанию 1).
        """
        self.A: int = A
        self.B: int = B
